# 题目：企业发放的奖金根据利润提成。
# 利润(I)低于或等于10万元时，奖金可提10%；
# 利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
# 20万到40万之间时，高于20万元的部分，可提成5%；
# 40万到60万之间时高于40万元的部分，可提成3%；
# 60万到100万之间时，高于60万元的部分，可提成1.5%，
# 高于100万元时，超过100万元的部分按1%提成，
# 从键盘输入当月利润I，求应发放奖金总数？


i=input("please input profits:")
if 0<=int(i)<=100000:
    bonus=int(i)*0.1
if 100000<int(i)<=200000:
    bonus=10000+(int(i)-100000)*0.075
if 200000<int(i)<=400000:
    bonus=10000+7500+(int(i)-200000)*0.05
if 400000<int(i)<=600000:
    bonus=10000+7500+10000+(int(i)-400000)*0.03
if 600000<int(i)<=1000000:
    bonus=10000+7500+10000+6000+(int(i)-600000)*0.015
if int(i)>1000000:
    bonus=10000+7500+10000+6000+6000+(int(i)-1000000)*0.01

print(bonus)


# ---------------------------------
j= int(input('净利润:'))
arr = [1000000,600000,400000,200000,100000,0]
rat = [0.01,0.015,0.03,0.05,0.075,0.1]
r = 0
for idx in range(0,6):
    if j>arr[idx]:
        r+=(j-arr[idx])*rat[idx]
        print((j-arr[idx])*rat[idx])
        j=arr[idx]
print(r)